---
kind: method
id: M:Autodesk.Revit.DB.UV.Negate
source: html/cef4dd78-6c38-28ee-c625-f3b391cbf1a4.htm
---
# Autodesk.Revit.DB.UV.Negate Method

Negates this 2-D vector.

## Syntax (C#)
```csharp
public UV Negate()
```

## Returns
The 2-D vector opposite to this vector.

## Remarks
The negated vector is obtained by changing the sign of each coordinate
of this vector.